3mdeb/openbsd-src/share/man/man4/man4.amd64/efi.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2022 3mdeb <contact@3mdeb.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 16 2022 $
.Dt EFI 4 amd64
.Os
.Sh NAME
.Nm efi
.Nd EFI services
.Sh SYNOPSIS
.Cd "efi* at bios0"
.Sh DESCRIPTION
The
.Nm
driver provides support for EFI services offered by UEFI
firmware implementations.
The driver is used for reading and setting the Real Time Clock,
performing reboot and shutdown and accessing ESRT (EFI System Resource Table)
via
.Xr ioctl 2
calls.
.Pp
The
.Nm
driver implements the following
.Xr ioctl 2
calls.
They are defined in
.In dev/efi/efiio.h
with support structures in
.In dev/efi/efi.h .
.Bl -tag -width Ds
.It Dv EFIIOC_GET_TABLE
.Pq Li "struct efi_get_table_ioc"
Read an EFI table.
The argument structure is as follows:
.Bd -literal -offset indent
struct efi_get_table_ioc {
	void *buf;		/* Pointer to userspace buffer */
	struct uuid uuid;	/* UUID to look up */
	size_t table_len;	/* Table size */
	size_t buf_len;		/* Size of the buffer */
};
.Ed
.Pp
The following UUIDs are accepted (defined in
.In dev/efi/efi.h ):
.Bd -literal -offset indent
#define EFI_TABLE_ESRT \\
	{0xb122a263,0x3661,0x4f68,0x99,0x29,{0x78,0xf8,0xb0,0xd6,0x21,0x80}}
.Ed
.El
.Sh SEE ALSO
.Xr intro 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
